plots/backups-plots/presentation-graalos/single-experiment/results/java/gv-video-processing-niuk-isolate-benchmark-1-1-2048/ab.log
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.18.0.2 (be patient).....done


Server Software:        
Server Hostname:        172.18.0.2
Server Port:            8080

Document Path:          /
Document Length:        86 bytes

Concurrency Level:      1
Time taken for tests:   6.810 seconds
Complete requests:      2
Failed requests:        0
Total transferred:      362 bytes
Total body sent:        588
HTML transferred:       172 bytes
Requests per second:    0.29 [#/sec] (mean)
Time per request:       3404.940 [ms] (mean)
Time per request:       3404.940 [ms] (mean, across all concurrent requests)
Transfer rate:          0.05 [Kbytes/sec] received
                        0.08 kb/s sent
                        0.14 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      0       0
Processing:  3390 3405  21.1   3420    3420
Waiting:     3390 3405  21.1   3420    3420
Total:       3390 3405  20.9   3420    3420

Percentage of the requests served within a certain time (ms)
  50%   3420
  66%   3420
  75%   3420
  80%   3420
  90%   3420
  95%   3420
  98%   3420
  99%   3420
 100%   3420 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.18.0.2 (be patient).....done


Server Software:        
Server Hostname:        172.18.0.2
Server Port:            8080

Document Path:          /
Document Length:        86 bytes

Concurrency Level:      1
Time taken for tests:   6.889 seconds
Complete requests:      2
Failed requests:        0
Total transferred:      362 bytes
Total body sent:        588
HTML transferred:       172 bytes
Requests per second:    0.29 [#/sec] (mean)
Time per request:       3444.615 [ms] (mean)
Time per request:       3444.615 [ms] (mean, across all concurrent requests)
Transfer rate:          0.05 [Kbytes/sec] received
                        0.08 kb/s sent
                        0.13 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:  3430 3444  21.0   3459    3459
Waiting:     3430 3444  21.0   3459    3459
Total:       3430 3445  20.8   3459    3459

Percentage of the requests served within a certain time (ms)
  50%   3459
  66%   3459
  75%   3459
  80%   3459
  90%   3459
  95%   3459
  98%   3459
  99%   3459
 100%   3459 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.18.0.2 (be patient).....done


Server Software:        
Server Hostname:        172.18.0.2
Server Port:            8080

Document Path:          /
Document Length:        86 bytes

Concurrency Level:      1
Time taken for tests:   6.962 seconds
Complete requests:      2
Failed requests:        0
Total transferred:      362 bytes
Total body sent:        588
HTML transferred:       172 bytes
Requests per second:    0.29 [#/sec] (mean)
Time per request:       3480.884 [ms] (mean)
Time per request:       3480.884 [ms] (mean, across all concurrent requests)
Transfer rate:          0.05 [Kbytes/sec] received
                        0.08 kb/s sent
                        0.13 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:  3470 3481  14.7   3491    3491
Waiting:     3470 3481  14.7   3491    3491
Total:       3471 3481  14.6   3491    3491

Percentage of the requests served within a certain time (ms)
  50%   3491
  66%   3491
  75%   3491
  80%   3491
  90%   3491
  95%   3491
  98%   3491
  99%   3491
 100%   3491 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.18.0.2 (be patient).....done


Server Software:        
Server Hostname:        172.18.0.2
Server Port:            8080

Document Path:          /
Document Length:        86 bytes

Concurrency Level:      1
Time taken for tests:   8.387 seconds
Complete requests:      2
Failed requests:        0
Total transferred:      362 bytes
Total body sent:        588
HTML transferred:       172 bytes
Requests per second:    0.24 [#/sec] (mean)
Time per request:       4193.306 [ms] (mean)
Time per request:       4193.306 [ms] (mean, across all concurrent requests)
Transfer rate:          0.04 [Kbytes/sec] received
                        0.07 kb/s sent
                        0.11 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.0      0       0
Processing:  4116 4193 109.7   4271    4271
Waiting:     4116 4193 109.7   4271    4271
Total:       4116 4193 109.7   4271    4271

Percentage of the requests served within a certain time (ms)
  50%   4271
  66%   4271
  75%   4271
  80%   4271
  90%   4271
  95%   4271
  98%   4271
  99%   4271
 100%   4271 (longest request)
This is ApacheBench, Version 2.3 <$Revision: 1879490 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking 172.18.0.2 (be patient).....done


Server Software:        
Server Hostname:        172.18.0.2
Server Port:            8080

Document Path:          /
Document Length:        86 bytes

Concurrency Level:      1
Time taken for tests:   8.298 seconds
Complete requests:      2
Failed requests:        0
Total transferred:      362 bytes
Total body sent:        588
HTML transferred:       172 bytes
Requests per second:    0.24 [#/sec] (mean)
Time per request:       4148.984 [ms] (mean)
Time per request:       4148.984 [ms] (mean, across all concurrent requests)
Transfer rate:          0.04 [Kbytes/sec] received
                        0.07 kb/s sent
                        0.11 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.1      0       0
Processing:  4135 4149  20.1   4163    4163
Waiting:     4135 4149  20.1   4163    4163
Total:       4135 4149  20.2   4163    4163

Percentage of the requests served within a certain time (ms)
  50%   4163
  66%   4163
  75%   4163
  80%   4163
  90%   4163
  95%   4163
  98%   4163
  99%   4163
 100%   4163 (longest request)